import React from "react";
import { Box, Typography } from "@mui/material";

export default function AboutPage() {
    return (
        <Box
            sx={{
                display: "flex",
                flexDirection: "column",
                alignItems: "center",
                justifyContent: "center",
                padding: 3,
                textAlign: "center",
            }}
        >
            <Typography variant="h4" sx={{ mb: 2, fontWeight: "bold" }}>
                אודות אתר המסעדות הכשרות
            </Typography>
            <Typography variant="body1" sx={{ mb: 3, maxWidth: "80vw", fontSize: "1.5rem", textAlign: "justify",direction: "rtl"  }}>
                האתר "כשרה" הוקמה במטרה לספק חוויה ייחודית ואיכותית לכל חובבי הקולינריה והמסעדות. כאן תוכלו לגלות מסעדות חדשות ומיוחדות, לשתף חוויות ולהכיר את המקומות הטובים ביותר בכל אזור. בין אם אתם מחפשים מסעדות בשריות, חלביות, אסייתיות, בתי קפה או אפילו מינימרקטים – האתר שלנו מספק את כל המידע במקום אחד.

                הממשק הידידותי מאפשר לכל משתמש להוסיף מסעדות בקלות, להעלות תמונות, להוסיף תיאור ולסמן תגיות ייחודיות המתארות את אופי המסעדה. בנוסף, ניתן לקרוא ביקורות, לצפות בתמונות, ולגלות את הדירוג של כל מסעדה. אנחנו מאמינים ששיתוף חוויות והמלצות עוזר לכולם ליהנות מחוויות קולינריות מגוונות ועשירות יותר.

                האתר פונה גם לבעלי מסעדות המעוניינים לפרסם את העסק שלהם ולהגיע לקהל יעד רחב יותר. בעזרת הכלים המתקדמים שלנו, ניתן להוסיף את פרטי המסעדה, לבחור תגיות ייחודיות, ולהציג תמונות שימשכו את תשומת לב הלקוחות.

                אנחנו מחויבים להעניק חוויה קלה, נוחה ונעימה לכל המשתמשים. האתר בנוי בצורה מודרנית ודינמית, מותאם לכל המכשירים – מחשבים, טאבלטים וסמארטפונים, כך שתוכלו לגלוש וליהנות מכל מקום ובכל זמן.

                אז למה אתם מחכים? התחילו לגלות, להוסיף ולשתף את המסעדות האהובות עליכם! יחד נבנה קהילה של אוהבי אוכל ומסעדות ונחזק את תרבות הקולינריה המקומית.

                ברוכים הבאים לאתר שמביא את כל המסעדות – אליכם!
            </Typography>
            <Box>
                <img
                    src="/images/RestDemo.png"
                    alt="RestCard"
                    style={{ width: "100%", maxWidth: 400 }}
                />
            </Box>

    
        </Box>
    );
}
